
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/mongulu-cm/mtchoun-mouh/actions/runs/12075545478)



<pre><code>Apply complete! Resources: 4 added, 5 changed, 1 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Running apply in the remote backend. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/tfc-mongulu-cm/mtchoun-mouh-fix-python-version/runs/run-vEzPBKJwNuAE6bNz

Waiting for the plan to start...

Terraform v1.9.6
on linux_amd64
Initializing plugins and modules...
data.archive_file.lambda_zip: Reading...
data.archive_file.lambda_zip: Read complete after 0s [id=623051e615259cbdddcff0797d5709f4a4b82142]
aws_cloudwatch_event_rule.scheduler: Refreshing state... [id=mtchoun-mouh-fix-python-version-trigger_user_scan]
aws_lambda_layer_version.test_lambda_layer: Refreshing state... [id=arn:aws:lambda:eu-central-1:053932140667:layer:test_lambda_layer:10]
aws_s3_bucket_object.example_file: Refreshing state... [id=index.html]
data.aws_iam_role.role: Reading...
data.aws_caller_identity.current: Reading...
aws_dynamodb_table.Register: Refreshing state... [id=mtchoun-mouh-fix-python-version-Register]
aws_dynamodb_table.Link_table: Refreshing state... [id=mtchoun-mouh-fix-python-version-Link_table]
aws_dynamodb_table.Users: Refreshing state... [id=mtchoun-mouh-fix-python-version-Users]
aws_s3_bucket.images: Refreshing state... [id=mtchoun-mouh-fix-python-version-djansang]
aws_s3_bucket.website: Refreshing state... [id=mtchoun-mouh-fix-python-version-mtchoun-mouh.mongulu.cm]
data.aws_caller_identity.current: Read complete after 1s [id=053932140667]
aws_api_gateway_rest_api.api: Refreshing state... [id=ki5oyio7lg]
data.aws_iam_role.role: Read complete after 1s [id=website-deployer]
aws_lambda_function.scan: Refreshing state... [id=mtchoun-mouh-fix-python-version-scan_user_consulcam]
aws_lambda_function.lambda: Refreshing state... [id=mtchoun-mouh-fix-python-version-user_registration_consulcam]
aws_api_gateway_resource.resource: Refreshing state... [id=86yb5q]
aws_api_gateway_method.method: Refreshing state... [id=agm-ki5oyio7lg-86yb5q-POST]
module.cors.aws_api_gateway_method._: Refreshing state... [id=agm-ki5oyio7lg-86yb5q-OPTIONS]
module.cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-ki5oyio7lg-86yb5q-OPTIONS-200]
aws_api_gateway_method_response.method_response_200: Refreshing state... [id=agmr-ki5oyio7lg-86yb5q-POST-200]
module.cors.aws_api_gateway_integration._: Refreshing state... [id=agi-ki5oyio7lg-86yb5q-OPTIONS]
aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_api_gateway_integration.integration: Refreshing state... [id=agi-ki5oyio7lg-86yb5q-POST]
aws_lambda_permission.allow_cloudwatch_to_call_check_foo: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_cloudwatch_event_target.target: Refreshing state... [id=mtchoun-mouh-fix-python-version-trigger_user_scan-lambda]
aws_api_gateway_deployment.test: Refreshing state... [id=79x840]
module.cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-ki5oyio7lg-86yb5q-OPTIONS-200]
local_file.index_page: Refreshing state... [id=99969e9c3579612c7cd7b3197207c13574a11a5e]
aws_s3_bucket_public_access_block.website: Refreshing state... [id=mtchoun-mouh-fix-python-version-mtchoun-mouh.mongulu.cm]
aws_s3_bucket_policy.website: Refreshing state... [id=mtchoun-mouh-fix-python-version-mtchoun-mouh.mongulu.cm]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_dynamodb_table.Link_table will be updated in-place
  ~ resource "aws_dynamodb_table" "Link_table" {
        id               = "mtchoun-mouh-fix-python-version-Link_table"
        name             = "mtchoun-mouh-fix-python-version-Link_table"
      ~ read_capacity    = 0 -> 3
        tags             = {
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
      ~ write_capacity   = 0 -> 1
        # (8 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "mtchoun-mouh-fix-python-version-user_registration_consulcam"
      ~ last_modified                  = "2024-11-28T21:13:07.060+0000" -> (known after apply)
      ~ source_code_hash               = "aG/693OgtesclFbtQG3JpowPoOxVEki6ETbi5wlrhnw=" -> "otjxhkmYsItml++V4smRv3rYS0aVLmDqtbuWboPiD7U="
        tags                           = {
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (23 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.scan will be updated in-place
  ~ resource "aws_lambda_function" "scan" {
        id                             = "mtchoun-mouh-fix-python-version-scan_user_consulcam"
      ~ last_modified                  = "2024-11-28T21:12:59.223+0000" -> (known after apply)
      ~ layers                         = [
          + "arn:aws:lambda:eu-central-1:053932140667:layer:test_lambda_layer:10",
        ]
      ~ source_code_hash               = "aG/693OgtesclFbtQG3JpowPoOxVEki6ETbi5wlrhnw=" -> "otjxhkmYsItml++V4smRv3rYS0aVLmDqtbuWboPiD7U="
        tags                           = {
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (22 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_s3_bucket.images will be updated in-place
  ~ resource "aws_s3_bucket" "images" {
        id                          = "mtchoun-mouh-fix-python-version-djansang"
        tags                        = {
            "Name"        = "images"
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (11 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket.website will be updated in-place
  ~ resource "aws_s3_bucket" "website" {
        id                          = "mtchoun-mouh-fix-python-version-mtchoun-mouh.mongulu.cm"
        tags                        = {
            "Name"        = "Website"
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (13 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket_object.demo_page will be created
  + resource "aws_s3_bucket_object" "demo_page" {
      + acl                    = "private"
      + bucket                 = "mtchoun-mouh-fix-python-version-mtchoun-mouh.mongulu.cm"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "demo.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../html/demo.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_bucket_object.example_file will be destroyed
  # (because aws_s3_bucket_object.example_file is not in configuration)
  - resource "aws_s3_bucket_object" "example_file" {
      - acl                           = "private" -> null
      - bucket                        = "mtchoun-mouh-fix-python-version-mtchoun-mouh.mongulu.cm" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "text/html" -> null
      - etag                          = "15cb3e6c0d277ef3360ab9eb2a29e0f4" -> null
      - force_destroy                 = false -> null
      - id                            = "index.html" -> null
      - key                           = "index.html" -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "../html/index.html" -> null
      - storage_class                 = "STANDARD" -> null
      - tags_all                      = {} -> null
        # (9 unchanged attributes hidden)
    }

  # aws_s3_bucket_object.index_page will be created
  + resource "aws_s3_bucket_object" "index_page" {
      + acl                    = "private"
      + bucket                 = "mtchoun-mouh-fix-python-version-mtchoun-mouh.mongulu.cm"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../html/index.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # local_file.demo_page will be created
  + resource "local_file" "demo_page" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../html/demo.html"
      + id                   = (known after apply)
    }

  # local_file.index_page will be created
  + resource "local_file" "index_page" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../html/index.html"
      + id                   = (known after apply)
    }

Plan: 4 to add, 5 to change, 1 to destroy.


------------------------------------------------------------------------

Cost estimation:

Resources: 3 of 6 estimated
           $1.872/mo +$0.7488

------------------------------------------------------------------------

aws_s3_bucket_object.example_file: Destroying... [id=index.html]
aws_dynamodb_table.Link_table: Modifying... [id=mtchoun-mouh-fix-python-version-Link_table]
aws_lambda_function.scan: Modifying... [id=mtchoun-mouh-fix-python-version-scan_user_consulcam]
aws_s3_bucket.images: Modifying... [id=mtchoun-mouh-fix-python-version-djansang]
aws_s3_bucket_object.example_file: Destruction complete after 0s
aws_lambda_function.lambda: Modifying... [id=mtchoun-mouh-fix-python-version-user_registration_consulcam]
aws_s3_bucket.website: Modifying... [id=mtchoun-mouh-fix-python-version-mtchoun-mouh.mongulu.cm]
aws_dynamodb_table.Link_table: Modifications complete after 2s [id=mtchoun-mouh-fix-python-version-Link_table]
aws_lambda_function.lambda: Modifications complete after 2s [id=mtchoun-mouh-fix-python-version-user_registration_consulcam]
local_file.demo_page: Creating...
local_file.index_page: Creating...
local_file.demo_page: Creation complete after 0s [id=b30c73b5545e2a35a9650816309bf849784132c3]
local_file.index_page: Creation complete after 0s [id=99969e9c3579612c7cd7b3197207c13574a11a5e]
aws_s3_bucket.images: Modifications complete after 4s [id=mtchoun-mouh-fix-python-version-djansang]
aws_s3_bucket.website: Modifications complete after 5s [id=mtchoun-mouh-fix-python-version-mtchoun-mouh.mongulu.cm]
aws_s3_bucket_object.index_page: Creating...
aws_s3_bucket_object.demo_page: Creating...
aws_s3_bucket_object.demo_page: Creation complete after 1s [id=demo.html]
aws_s3_bucket_object.index_page: Creation complete after 1s [id=index.html]
aws_lambda_function.scan: Modifications complete after 9s [id=mtchoun-mouh-fix-python-version-scan_user_consulcam]

Apply complete! Resources: 4 added, 5 changed, 1 destroyed.

Outputs:

register_table = "mtchoun-mouh-fix-python-version-Register"
stage_url = "https://ki5oyio7lg.execute-api.eu-central-1.amazonaws.com/mtchoun-mouh-fix-python-version-dev"
website_url = "http://mtchoun-mouh-fix-python-version-mtchoun-mouh.mongulu.cm.s3-website.eu-central-1.amazonaws.com"

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"deploy","PRNumber":195,"Program":"tfcmt","SHA1":"f6b198574491630c583aae9434744892063dbb00","Vars":{},"WorkflowName":"Deploy cases"} -->